# Задание №1
# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.

num = 12
pi = 3.14
my_str = 'Hello, world!'
my_tuple = (1, 2, 3)
print(
    f'{num = } имеет тип {type(num)}\n'
    f'{pi = } имеет тип {type(pi)}\n'
    f'{my_str = } имеет тип {type(my_str)}\n'
    f'{my_tuple = } имеет тип {type(my_tuple)}'
)
